name: "Inception-Resnet-v2"
### input ####
input: "data"
input_shape {
	dim: 1
	dim: 3
	dim: 299
	dim: 299
}
input: "im_info"
input_shape {
	dim: 1
	dim: 3
}
layer {
  name: "conv1_3x3_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1_3x3_s2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "conv1_3x3_s2_bn"
  type: "BatchNorm"
  bottom: "conv1_3x3_s2"
  top: "conv1_3x3_s2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv1_3x3_s2_scale"
  type: "Scale"
  bottom: "conv1_3x3_s2"
  top: "conv1_3x3_s2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_3x3_s2_relu"
  type: "ReLU"
  bottom: "conv1_3x3_s2"
  top: "conv1_3x3_s2"
}
layer {
  name: "conv2a_3x3_s1"
  type: "Convolution"
  bottom: "conv1_3x3_s2"
  top: "conv2a_3x3_s1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "conv2a_3x3_s1_bn"
  type: "BatchNorm"
  bottom: "conv2a_3x3_s1"
  top: "conv2a_3x3_s1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2a_3x3_s1_scale"
  type: "Scale"
  bottom: "conv2a_3x3_s1"
  top: "conv2a_3x3_s1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2a_3x3_s1_relu"
  type: "ReLU"
  bottom: "conv2a_3x3_s1"
  top: "conv2a_3x3_s1"
}
layer {
  name: "conv2b_3x3_s1"
  type: "Convolution"
  bottom: "conv2a_3x3_s1"
  top: "conv2b_3x3_s1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "conv2b_3x3_s1_bn"
  type: "BatchNorm"
  bottom: "conv2b_3x3_s1"
  top: "conv2b_3x3_s1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2b_3x3_s1_scale"
  type: "Scale"
  bottom: "conv2b_3x3_s1"
  top: "conv2b_3x3_s1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2b_3x3_s1_relu"
  type: "ReLU"
  bottom: "conv2b_3x3_s1"
  top: "conv2b_3x3_s1"
}
layer {
  name: "pool_3a"
  type: "Pooling"
  bottom: "conv2b_3x3_s1"
  top: "pool_3a"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_1x1_s1"
  type: "Convolution"
  bottom: "pool_3a"
  top: "conv3_1x1_s1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 80
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "conv3_1x1_s1_bn"
  type: "BatchNorm"
  bottom: "conv3_1x1_s1"
  top: "conv3_1x1_s1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_1x1_s1_scale"
  type: "Scale"
  bottom: "conv3_1x1_s1"
  top: "conv3_1x1_s1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_1x1_s1_relu"
  type: "ReLU"
  bottom: "conv3_1x1_s1"
  top: "conv3_1x1_s1"
}
layer {
  name: "conv4_3x3_s1"
  type: "Convolution"
  bottom: "conv3_1x1_s1"
  top: "conv4_3x3_s1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "conv4_3x3_s1_bn"
  type: "BatchNorm"
  bottom: "conv4_3x3_s1"
  top: "conv4_3x3_s1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv4_3x3_s1_scale"
  type: "Scale"
  bottom: "conv4_3x3_s1"
  top: "conv4_3x3_s1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv4_3x3_s1_relu"
  type: "ReLU"
  bottom: "conv4_3x3_s1"
  top: "conv4_3x3_s1"
}
layer {
  name: "pool_5a"
  type: "Pooling"
  bottom: "conv4_3x3_s1"
  top: "pool_5a"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "mixed_5b_branch_0_1x1"
  type: "Convolution"
  bottom: "pool_5a"
  top: "mixed_5b_branch_0_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "mixed_5b_branch_0_1x1_bn"
  type: "BatchNorm"
  bottom: "mixed_5b_branch_0_1x1"
  top: "mixed_5b_branch_0_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "mixed_5b_branch_0_1x1_scale"
  type: "Scale"
  bottom: "mixed_5b_branch_0_1x1"
  top: "mixed_5b_branch_0_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5b_branch_0_1x1_relu"
  type: "ReLU"
  bottom: "mixed_5b_branch_0_1x1"
  top: "mixed_5b_branch_0_1x1"
}
layer {
  name: "mixed_5b_branch_1_1x1"
  type: "Convolution"
  bottom: "pool_5a"
  top: "mixed_5b_branch_1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "mixed_5b_branch_1_1x1_bn"
  type: "BatchNorm"
  bottom: "mixed_5b_branch_1_1x1"
  top: "mixed_5b_branch_1_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "mixed_5b_branch_1_1x1_scale"
  type: "Scale"
  bottom: "mixed_5b_branch_1_1x1"
  top: "mixed_5b_branch_1_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5b_branch_1_1x1_relu"
  type: "ReLU"
  bottom: "mixed_5b_branch_1_1x1"
  top: "mixed_5b_branch_1_1x1"
}
layer {
  name: "mixed_5b_branch_1_5x5"
  type: "Convolution"
  bottom: "mixed_5b_branch_1_1x1"
  top: "mixed_5b_branch_1_5x5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "mixed_5b_branch_1_5x5_bn"
  type: "BatchNorm"
  bottom: "mixed_5b_branch_1_5x5"
  top: "mixed_5b_branch_1_5x5"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "mixed_5b_branch_1_5x5_scale"
  type: "Scale"
  bottom: "mixed_5b_branch_1_5x5"
  top: "mixed_5b_branch_1_5x5"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5b_branch_1_5x5_relu"
  type: "ReLU"
  bottom: "mixed_5b_branch_1_5x5"
  top: "mixed_5b_branch_1_5x5"
}
layer {
  name: "mixed_5b_branch_2_1x1"
  type: "Convolution"
  bottom: "pool_5a"
  top: "mixed_5b_branch_2_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "mixed_5b_branch_2_1x1_bn"
  type: "BatchNorm"
  bottom: "mixed_5b_branch_2_1x1"
  top: "mixed_5b_branch_2_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "mixed_5b_branch_2_1x1_scale"
  type: "Scale"
  bottom: "mixed_5b_branch_2_1x1"
  top: "mixed_5b_branch_2_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5b_branch_2_1x1_relu"
  type: "ReLU"
  bottom: "mixed_5b_branch_2_1x1"
  top: "mixed_5b_branch_2_1x1"
}
layer {
  name: "mixed_5b_branch_2_3x3"
  type: "Convolution"
  bottom: "mixed_5b_branch_2_1x1"
  top: "mixed_5b_branch_2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "mixed_5b_branch_2_3x3_bn"
  type: "BatchNorm"
  bottom: "mixed_5b_branch_2_3x3"
  top: "mixed_5b_branch_2_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "mixed_5b_branch_2_3x3_scale"
  type: "Scale"
  bottom: "mixed_5b_branch_2_3x3"
  top: "mixed_5b_branch_2_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5b_branch_2_3x3_relu"
  type: "ReLU"
  bottom: "mixed_5b_branch_2_3x3"
  top: "mixed_5b_branch_2_3x3"
}
layer {
  name: "mixed_5b_branch_2_3x3_1"
  type: "Convolution"
  bottom: "mixed_5b_branch_2_3x3"
  top: "mixed_5b_branch_2_3x3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "mixed_5b_branch_2_3x3_1_bn"
  type: "BatchNorm"
  bottom: "mixed_5b_branch_2_3x3_1"
  top: "mixed_5b_branch_2_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "mixed_5b_branch_2_3x3_1_scale"
  type: "Scale"
  bottom: "mixed_5b_branch_2_3x3_1"
  top: "mixed_5b_branch_2_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5b_branch_2_3x3_1_relu"
  type: "ReLU"
  bottom: "mixed_5b_branch_2_3x3_1"
  top: "mixed_5b_branch_2_3x3_1"
}
layer {
  name: "mixed_5b_branch_3_pool"
  type: "Pooling"
  bottom: "pool_5a"
  top: "mixed_5b_branch_3_pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "mixed_5b_branch_3_1x1"
  type: "Convolution"
  bottom: "mixed_5b_branch_3_pool"
  top: "mixed_5b_branch_3_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "mixed_5b_branch_3_1x1_bn"
  type: "BatchNorm"
  bottom: "mixed_5b_branch_3_1x1"
  top: "mixed_5b_branch_3_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "mixed_5b_branch_3_1x1_scale"
  type: "Scale"
  bottom: "mixed_5b_branch_3_1x1"
  top: "mixed_5b_branch_3_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "mixed_5b_branch_3_1x1_relu"
  type: "ReLU"
  bottom: "mixed_5b_branch_3_1x1"
  top: "mixed_5b_branch_3_1x1"
}
layer {
  name: "mixed_5b"
  type: "Concat"
  bottom: "mixed_5b_branch_0_1x1"
  bottom: "mixed_5b_branch_1_5x5"
  bottom: "mixed_5b_branch_2_3x3_1"
  bottom: "mixed_5b_branch_3_1x1"
  top: "mixed_5b"
}
layer {
  name: "a1_1x1"
  type: "Convolution"
  bottom: "mixed_5b"
  top: "a1_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a1_1x1_bn"
  type: "BatchNorm"
  bottom: "a1_1x1"
  top: "a1_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a1_1x1_scale"
  type: "Scale"
  bottom: "a1_1x1"
  top: "a1_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a1_1x1_relu"
  type: "ReLU"
  bottom: "a1_1x1"
  top: "a1_1x1"
}
layer {
  name: "a1_3x3_reduce"
  type: "Convolution"
  bottom: "mixed_5b"
  top: "a1_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a1_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "a1_3x3_reduce"
  top: "a1_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a1_3x3_reduce_scale"
  type: "Scale"
  bottom: "a1_3x3_reduce"
  top: "a1_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a1_3x3_reduce_relu"
  type: "ReLU"
  bottom: "a1_3x3_reduce"
  top: "a1_3x3_reduce"
}
layer {
  name: "a1_3x3"
  type: "Convolution"
  bottom: "a1_3x3_reduce"
  top: "a1_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a1_3x3_bn"
  type: "BatchNorm"
  bottom: "a1_3x3"
  top: "a1_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a1_3x3_scale"
  type: "Scale"
  bottom: "a1_3x3"
  top: "a1_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a1_3x3_relu"
  type: "ReLU"
  bottom: "a1_3x3"
  top: "a1_3x3"
}
layer {
  name: "a1_3x3_2_reduce"
  type: "Convolution"
  bottom: "mixed_5b"
  top: "a1_3x3_2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a1_3x3_2_reduce_bn"
  type: "BatchNorm"
  bottom: "a1_3x3_2_reduce"
  top: "a1_3x3_2_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a1_3x3_2_reduce_scale"
  type: "Scale"
  bottom: "a1_3x3_2_reduce"
  top: "a1_3x3_2_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a1_3x3_2_reduce_relu"
  type: "ReLU"
  bottom: "a1_3x3_2_reduce"
  top: "a1_3x3_2_reduce"
}
layer {
  name: "a1_3x3_2"
  type: "Convolution"
  bottom: "a1_3x3_2_reduce"
  top: "a1_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a1_3x3_2_bn"
  type: "BatchNorm"
  bottom: "a1_3x3_2"
  top: "a1_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a1_3x3_2_scale"
  type: "Scale"
  bottom: "a1_3x3_2"
  top: "a1_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a1_3x3_2_relu"
  type: "ReLU"
  bottom: "a1_3x3_2"
  top: "a1_3x3_2"
}
layer {
  name: "a1_3x3_3"
  type: "Convolution"
  bottom: "a1_3x3_2"
  top: "a1_3x3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a1_3x3_3_bn"
  type: "BatchNorm"
  bottom: "a1_3x3_3"
  top: "a1_3x3_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a1_3x3_3_scale"
  type: "Scale"
  bottom: "a1_3x3_3"
  top: "a1_3x3_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a1_3x3_3_relu"
  type: "ReLU"
  bottom: "a1_3x3_3"
  top: "a1_3x3_3"
}
layer {
  name: "a1_concat"
  type: "Concat"
  bottom: "a1_1x1"
  bottom: "a1_3x3"
  bottom: "a1_3x3_3"
  top: "a1_concat"
}
layer {
  name: "a1_1x1_2"
  type: "Convolution"
  bottom: "a1_concat"
  top: "a1_1x1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "a1_1x1_2_power"
  type: "Power"
  bottom: "a1_1x1_2"
  top: "a1_1x1_2_power"
  power_param {
    power: 1
    scale: 0.17
    shift: 0
  }
}
layer {
  name: "a1_residual_eltwise"
  type: "Eltwise"
  bottom: "mixed_5b"
  bottom: "a1_1x1_2_power"
  top: "a1_residual_eltwise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "a1_residual_eltwise_relu"
  type: "ReLU"
  bottom: "a1_residual_eltwise"
  top: "a1_residual_eltwise"
}
layer {
  name: "a2_1x1"
  type: "Convolution"
  bottom: "a1_residual_eltwise"
  top: "a2_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a2_1x1_bn"
  type: "BatchNorm"
  bottom: "a2_1x1"
  top: "a2_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a2_1x1_scale"
  type: "Scale"
  bottom: "a2_1x1"
  top: "a2_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a2_1x1_relu"
  type: "ReLU"
  bottom: "a2_1x1"
  top: "a2_1x1"
}
layer {
  name: "a2_3x3_reduce"
  type: "Convolution"
  bottom: "a1_residual_eltwise"
  top: "a2_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a2_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "a2_3x3_reduce"
  top: "a2_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a2_3x3_reduce_scale"
  type: "Scale"
  bottom: "a2_3x3_reduce"
  top: "a2_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a2_3x3_reduce_relu"
  type: "ReLU"
  bottom: "a2_3x3_reduce"
  top: "a2_3x3_reduce"
}
layer {
  name: "a2_3x3"
  type: "Convolution"
  bottom: "a2_3x3_reduce"
  top: "a2_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a2_3x3_bn"
  type: "BatchNorm"
  bottom: "a2_3x3"
  top: "a2_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a2_3x3_scale"
  type: "Scale"
  bottom: "a2_3x3"
  top: "a2_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a2_3x3_relu"
  type: "ReLU"
  bottom: "a2_3x3"
  top: "a2_3x3"
}
layer {
  name: "a2_3x3_2_reduce"
  type: "Convolution"
  bottom: "a1_residual_eltwise"
  top: "a2_3x3_2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a2_3x3_2_reduce_bn"
  type: "BatchNorm"
  bottom: "a2_3x3_2_reduce"
  top: "a2_3x3_2_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a2_3x3_2_reduce_scale"
  type: "Scale"
  bottom: "a2_3x3_2_reduce"
  top: "a2_3x3_2_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a2_3x3_2_reduce_relu"
  type: "ReLU"
  bottom: "a2_3x3_2_reduce"
  top: "a2_3x3_2_reduce"
}
layer {
  name: "a2_3x3_2"
  type: "Convolution"
  bottom: "a2_3x3_2_reduce"
  top: "a2_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a2_3x3_2_bn"
  type: "BatchNorm"
  bottom: "a2_3x3_2"
  top: "a2_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a2_3x3_2_scale"
  type: "Scale"
  bottom: "a2_3x3_2"
  top: "a2_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a2_3x3_2_relu"
  type: "ReLU"
  bottom: "a2_3x3_2"
  top: "a2_3x3_2"
}
layer {
  name: "a2_3x3_3"
  type: "Convolution"
  bottom: "a2_3x3_2"
  top: "a2_3x3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a2_3x3_3_bn"
  type: "BatchNorm"
  bottom: "a2_3x3_3"
  top: "a2_3x3_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a2_3x3_3_scale"
  type: "Scale"
  bottom: "a2_3x3_3"
  top: "a2_3x3_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a2_3x3_3_relu"
  type: "ReLU"
  bottom: "a2_3x3_3"
  top: "a2_3x3_3"
}
layer {
  name: "a2_concat"
  type: "Concat"
  bottom: "a2_1x1"
  bottom: "a2_3x3"
  bottom: "a2_3x3_3"
  top: "a2_concat"
}
layer {
  name: "a2_1x1_2"
  type: "Convolution"
  bottom: "a2_concat"
  top: "a2_1x1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "a2_1x1_2_power"
  type: "Power"
  bottom: "a2_1x1_2"
  top: "a2_1x1_2_power"
  power_param {
    power: 1
    scale: 0.17
    shift: 0
  }
}
layer {
  name: "a2_residual_eltwise"
  type: "Eltwise"
  bottom: "a1_residual_eltwise"
  bottom: "a2_1x1_2_power"
  top: "a2_residual_eltwise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "a2_residual_eltwise_relu"
  type: "ReLU"
  bottom: "a2_residual_eltwise"
  top: "a2_residual_eltwise"
}
layer {
  name: "a3_1x1"
  type: "Convolution"
  bottom: "a2_residual_eltwise"
  top: "a3_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a3_1x1_bn"
  type: "BatchNorm"
  bottom: "a3_1x1"
  top: "a3_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a3_1x1_scale"
  type: "Scale"
  bottom: "a3_1x1"
  top: "a3_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a3_1x1_relu"
  type: "ReLU"
  bottom: "a3_1x1"
  top: "a3_1x1"
}
layer {
  name: "a3_3x3_reduce"
  type: "Convolution"
  bottom: "a2_residual_eltwise"
  top: "a3_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a3_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "a3_3x3_reduce"
  top: "a3_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a3_3x3_reduce_scale"
  type: "Scale"
  bottom: "a3_3x3_reduce"
  top: "a3_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a3_3x3_reduce_relu"
  type: "ReLU"
  bottom: "a3_3x3_reduce"
  top: "a3_3x3_reduce"
}
layer {
  name: "a3_3x3"
  type: "Convolution"
  bottom: "a3_3x3_reduce"
  top: "a3_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a3_3x3_bn"
  type: "BatchNorm"
  bottom: "a3_3x3"
  top: "a3_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a3_3x3_scale"
  type: "Scale"
  bottom: "a3_3x3"
  top: "a3_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a3_3x3_relu"
  type: "ReLU"
  bottom: "a3_3x3"
  top: "a3_3x3"
}
layer {
  name: "a3_3x3_2_reduce"
  type: "Convolution"
  bottom: "a2_residual_eltwise"
  top: "a3_3x3_2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a3_3x3_2_reduce_bn"
  type: "BatchNorm"
  bottom: "a3_3x3_2_reduce"
  top: "a3_3x3_2_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a3_3x3_2_reduce_scale"
  type: "Scale"
  bottom: "a3_3x3_2_reduce"
  top: "a3_3x3_2_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a3_3x3_2_reduce_relu"
  type: "ReLU"
  bottom: "a3_3x3_2_reduce"
  top: "a3_3x3_2_reduce"
}
layer {
  name: "a3_3x3_2"
  type: "Convolution"
  bottom: "a3_3x3_2_reduce"
  top: "a3_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a3_3x3_2_bn"
  type: "BatchNorm"
  bottom: "a3_3x3_2"
  top: "a3_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a3_3x3_2_scale"
  type: "Scale"
  bottom: "a3_3x3_2"
  top: "a3_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a3_3x3_2_relu"
  type: "ReLU"
  bottom: "a3_3x3_2"
  top: "a3_3x3_2"
}
layer {
  name: "a3_3x3_3"
  type: "Convolution"
  bottom: "a3_3x3_2"
  top: "a3_3x3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a3_3x3_3_bn"
  type: "BatchNorm"
  bottom: "a3_3x3_3"
  top: "a3_3x3_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a3_3x3_3_scale"
  type: "Scale"
  bottom: "a3_3x3_3"
  top: "a3_3x3_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a3_3x3_3_relu"
  type: "ReLU"
  bottom: "a3_3x3_3"
  top: "a3_3x3_3"
}
layer {
  name: "a3_concat"
  type: "Concat"
  bottom: "a3_1x1"
  bottom: "a3_3x3"
  bottom: "a3_3x3_3"
  top: "a3_concat"
}
layer {
  name: "a3_1x1_2"
  type: "Convolution"
  bottom: "a3_concat"
  top: "a3_1x1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "a3_1x1_2_power"
  type: "Power"
  bottom: "a3_1x1_2"
  top: "a3_1x1_2_power"
  power_param {
    power: 1
    scale: 0.17
    shift: 0
  }
}
layer {
  name: "a3_residual_eltwise"
  type: "Eltwise"
  bottom: "a2_residual_eltwise"
  bottom: "a3_1x1_2_power"
  top: "a3_residual_eltwise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "a3_residual_eltwise_relu"
  type: "ReLU"
  bottom: "a3_residual_eltwise"
  top: "a3_residual_eltwise"
}
layer {
  name: "a4_1x1"
  type: "Convolution"
  bottom: "a3_residual_eltwise"
  top: "a4_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a4_1x1_bn"
  type: "BatchNorm"
  bottom: "a4_1x1"
  top: "a4_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a4_1x1_scale"
  type: "Scale"
  bottom: "a4_1x1"
  top: "a4_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a4_1x1_relu"
  type: "ReLU"
  bottom: "a4_1x1"
  top: "a4_1x1"
}
layer {
  name: "a4_3x3_reduce"
  type: "Convolution"
  bottom: "a3_residual_eltwise"
  top: "a4_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a4_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "a4_3x3_reduce"
  top: "a4_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a4_3x3_reduce_scale"
  type: "Scale"
  bottom: "a4_3x3_reduce"
  top: "a4_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a4_3x3_reduce_relu"
  type: "ReLU"
  bottom: "a4_3x3_reduce"
  top: "a4_3x3_reduce"
}
layer {
  name: "a4_3x3"
  type: "Convolution"
  bottom: "a4_3x3_reduce"
  top: "a4_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a4_3x3_bn"
  type: "BatchNorm"
  bottom: "a4_3x3"
  top: "a4_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a4_3x3_scale"
  type: "Scale"
  bottom: "a4_3x3"
  top: "a4_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a4_3x3_relu"
  type: "ReLU"
  bottom: "a4_3x3"
  top: "a4_3x3"
}
layer {
  name: "a4_3x3_2_reduce"
  type: "Convolution"
  bottom: "a3_residual_eltwise"
  top: "a4_3x3_2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a4_3x3_2_reduce_bn"
  type: "BatchNorm"
  bottom: "a4_3x3_2_reduce"
  top: "a4_3x3_2_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a4_3x3_2_reduce_scale"
  type: "Scale"
  bottom: "a4_3x3_2_reduce"
  top: "a4_3x3_2_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a4_3x3_2_reduce_relu"
  type: "ReLU"
  bottom: "a4_3x3_2_reduce"
  top: "a4_3x3_2_reduce"
}
layer {
  name: "a4_3x3_2"
  type: "Convolution"
  bottom: "a4_3x3_2_reduce"
  top: "a4_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a4_3x3_2_bn"
  type: "BatchNorm"
  bottom: "a4_3x3_2"
  top: "a4_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a4_3x3_2_scale"
  type: "Scale"
  bottom: "a4_3x3_2"
  top: "a4_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a4_3x3_2_relu"
  type: "ReLU"
  bottom: "a4_3x3_2"
  top: "a4_3x3_2"
}
layer {
  name: "a4_3x3_3"
  type: "Convolution"
  bottom: "a4_3x3_2"
  top: "a4_3x3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a4_3x3_3_bn"
  type: "BatchNorm"
  bottom: "a4_3x3_3"
  top: "a4_3x3_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a4_3x3_3_scale"
  type: "Scale"
  bottom: "a4_3x3_3"
  top: "a4_3x3_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a4_3x3_3_relu"
  type: "ReLU"
  bottom: "a4_3x3_3"
  top: "a4_3x3_3"
}
layer {
  name: "a4_concat"
  type: "Concat"
  bottom: "a4_1x1"
  bottom: "a4_3x3"
  bottom: "a4_3x3_3"
  top: "a4_concat"
}
layer {
  name: "a4_1x1_2"
  type: "Convolution"
  bottom: "a4_concat"
  top: "a4_1x1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "a4_1x1_2_power"
  type: "Power"
  bottom: "a4_1x1_2"
  top: "a4_1x1_2_power"
  power_param {
    power: 1
    scale: 0.17
    shift: 0
  }
}
layer {
  name: "a4_residual_eltwise"
  type: "Eltwise"
  bottom: "a3_residual_eltwise"
  bottom: "a4_1x1_2_power"
  top: "a4_residual_eltwise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "a4_residual_eltwise_relu"
  type: "ReLU"
  bottom: "a4_residual_eltwise"
  top: "a4_residual_eltwise"
}
layer {
  name: "a5_1x1"
  type: "Convolution"
  bottom: "a4_residual_eltwise"
  top: "a5_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a5_1x1_bn"
  type: "BatchNorm"
  bottom: "a5_1x1"
  top: "a5_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a5_1x1_scale"
  type: "Scale"
  bottom: "a5_1x1"
  top: "a5_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a5_1x1_relu"
  type: "ReLU"
  bottom: "a5_1x1"
  top: "a5_1x1"
}
layer {
  name: "a5_3x3_reduce"
  type: "Convolution"
  bottom: "a4_residual_eltwise"
  top: "a5_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a5_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "a5_3x3_reduce"
  top: "a5_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a5_3x3_reduce_scale"
  type: "Scale"
  bottom: "a5_3x3_reduce"
  top: "a5_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a5_3x3_reduce_relu"
  type: "ReLU"
  bottom: "a5_3x3_reduce"
  top: "a5_3x3_reduce"
}
layer {
  name: "a5_3x3"
  type: "Convolution"
  bottom: "a5_3x3_reduce"
  top: "a5_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a5_3x3_bn"
  type: "BatchNorm"
  bottom: "a5_3x3"
  top: "a5_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a5_3x3_scale"
  type: "Scale"
  bottom: "a5_3x3"
  top: "a5_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a5_3x3_relu"
  type: "ReLU"
  bottom: "a5_3x3"
  top: "a5_3x3"
}
layer {
  name: "a5_3x3_2_reduce"
  type: "Convolution"
  bottom: "a4_residual_eltwise"
  top: "a5_3x3_2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a5_3x3_2_reduce_bn"
  type: "BatchNorm"
  bottom: "a5_3x3_2_reduce"
  top: "a5_3x3_2_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a5_3x3_2_reduce_scale"
  type: "Scale"
  bottom: "a5_3x3_2_reduce"
  top: "a5_3x3_2_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a5_3x3_2_reduce_relu"
  type: "ReLU"
  bottom: "a5_3x3_2_reduce"
  top: "a5_3x3_2_reduce"
}
layer {
  name: "a5_3x3_2"
  type: "Convolution"
  bottom: "a5_3x3_2_reduce"
  top: "a5_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a5_3x3_2_bn"
  type: "BatchNorm"
  bottom: "a5_3x3_2"
  top: "a5_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a5_3x3_2_scale"
  type: "Scale"
  bottom: "a5_3x3_2"
  top: "a5_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a5_3x3_2_relu"
  type: "ReLU"
  bottom: "a5_3x3_2"
  top: "a5_3x3_2"
}
layer {
  name: "a5_3x3_3"
  type: "Convolution"
  bottom: "a5_3x3_2"
  top: "a5_3x3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a5_3x3_3_bn"
  type: "BatchNorm"
  bottom: "a5_3x3_3"
  top: "a5_3x3_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a5_3x3_3_scale"
  type: "Scale"
  bottom: "a5_3x3_3"
  top: "a5_3x3_3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a5_3x3_3_relu"
  type: "ReLU"
  bottom: "a5_3x3_3"
  top: "a5_3x3_3"
}
layer {
  name: "a5_concat"
  type: "Concat"
  bottom: "a5_1x1"
  bottom: "a5_3x3"
  bottom: "a5_3x3_3"
  top: "a5_concat"
}
layer {
  name: "a5_1x1_2"
  type: "Convolution"
  bottom: "a5_concat"
  top: "a5_1x1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "a5_1x1_2_power"
  type: "Power"
  bottom: "a5_1x1_2"
  top: "a5_1x1_2_power"
  power_param {
    power: 1
    scale: 0.17
    shift: 0
  }
}
layer {
  name: "a5_residual_eltwise"
  type: "Eltwise"
  bottom: "a4_residual_eltwise"
  bottom: "a5_1x1_2_power"
  top: "a5_residual_eltwise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "a5_residual_eltwise_relu"
  type: "ReLU"
  bottom: "a5_residual_eltwise"
  top: "a5_residual_eltwise"
}
layer {
  name: "a6_1x1"
  type: "Convolution"
  bottom: "a5_residual_eltwise"
  top: "a6_1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a6_1x1_bn"
  type: "BatchNorm"
  bottom: "a6_1x1"
  top: "a6_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a6_1x1_scale"
  type: "Scale"
  bottom: "a6_1x1"
  top: "a6_1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a6_1x1_relu"
  type: "ReLU"
  bottom: "a6_1x1"
  top: "a6_1x1"
}
layer {
  name: "a6_3x3_reduce"
  type: "Convolution"
  bottom: "a5_residual_eltwise"
  top: "a6_3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a6_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "a6_3x3_reduce"
  top: "a6_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a6_3x3_reduce_scale"
  type: "Scale"
  bottom: "a6_3x3_reduce"
  top: "a6_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a6_3x3_reduce_relu"
  type: "ReLU"
  bottom: "a6_3x3_reduce"
  top: "a6_3x3_reduce"
}
layer {
  name: "a6_3x3"
  type: "Convolution"
  bottom: "a6_3x3_reduce"
  top: "a6_3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a6_3x3_bn"
  type: "BatchNorm"
  bottom: "a6_3x3"
  top: "a6_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a6_3x3_scale"
  type: "Scale"
  bottom: "a6_3x3"
  top: "a6_3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a6_3x3_relu"
  type: "ReLU"
  bottom: "a6_3x3"
  top: "a6_3x3"
}
layer {
  name: "a6_3x3_2_reduce"
  type: "Convolution"
  bottom: "a5_residual_eltwise"
  top: "a6_3x3_2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
layer {
  name: "a6_3x3_2_reduce_bn"
  type: "BatchNorm"
  bottom: "a6_3x3_2_reduce"
  top: "a6_3x3_2_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "a6_3x3_2_reduce_scale"
  type: "Scale"
  bottom: "a6_3x3_2_reduce"
  top: "a6_3x3_2_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "a6_3x3_2_reduce_relu"
  type: "ReLU"
  bottom: "a6_3x3_2_reduce"
  top: "a6_3x3_2_reduce"
}
layer {
  name: "a6_3x3_2"
  type: "Convolution"
  bottom: "a6_3x3_2_reduce"
  top: "a6_3x3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
  }
}
